"""
Напишите программу, которая считывает с клавиатуры последовательно три строки: название фильма, название кинотеатра и
время, после чего выводит на экран «Билет на " [название фильма] " в " [название кинотеатра] " на [время] забронирован.»
"""


a = input()
b = input()
c = input()
print('Билет на "', a, '" в "', b, '" на', c, 'забронирован.')
