"""
Напишите программу, которая сначала считывает три фразы по очереди, а потом воспроизводит их в той же
последовательности, каждую на отдельной строчке.
"""


a = input()
b = input()
c = input()
print(a)
print(b)
print(c)
