"""
Напишите программу, которая считывает слово, затем выводит: «[это слово] ? Конечно, помню, ведь мы проходили это на
прошлом занятии!».
"""


slovo = input()
print(slovo, "? Конечно, помню, ведь мы проходили это на прошлом занятии!")
