"""


Напишите программу, которая считывает слово (или фразу, неважно) и тут же выводит её, и больше ничего не делает.

Особое условие: необходимо написать эту программу в одну строчку, ограничившись 14 символами.

"""


print(input())
