"""
Напишите программу, которая считывает с клавиатуры слово (или фразу, неважно), после чего выводит это же слово четыре
раза на одной строке, не разделяя их пробелами.
"""


word = input()
print(word * 4)
