"""


Напишите программу, которая считывает с клавиатуры строку и выводит фразу:

«Слово [введённая строка] имеет длину [длина введённой строки]».

"""


a = input()
b = (len(a))
print(f"Слово {a} имеет длину {b}")
