"""
Напишите программу, которая считывает с клавиатуры одно дробное число, после чего выводит «+», «-» или «0», если это
число – положительное, отрицательное или ноль, соответственно.
"""


a = float(input())
b = 0
if a > b:
    print("+")
elif a < b:
    print("-")
else:
    print("0")
