"""


Королю замка Еинавзан пришло донесение, что на его обитель идут войска грозного противника. У жителей королевства может
быть только одно преимущество – запереться в замке и отражать атаки врага с крепостных стен, пока не подойдет помощь
союзников. Чтобы увеличить шансы на успех, король приказал выкопать ров вокруг замка, но времени осталось
катастрофически мало, через два дня враг будет уже слишком близко. Помогите королю понять, сколько людей надо отправить
на подготовку рва, пока остальные жители окрестных деревень будут перебираться в замок и готовить запасы, если за день
один землекоп может выкопать ров длиной в 3 метра, а длина предполагаемого рва – 1400 метров.
Формат вывода

Одно число - необходимое количество землекопов.

"""


rov = 1400
zeml = 3 * 2
a = rov // zeml
print(a + 1)
