"""
Напишите программу, которая считывает с клавиатуры одно за другим два дробных числа и выводит их сумму.
"""


a = float(input())
b = float(input())
print(a + b)
