"""
Напишите программу, которая считывает с клавиатуры одно за другим два целых числа и выводит их сумму.
"""


a = int(input())
b = int(input())
print(a + b)
