"""
Напишите оставшуюся часть программы. Она должна вывести на экран решение уравнения x + b = a, где x — неизвестное, a и b
 — числа, равные тем значениям, которые присвоены соответствующим переменным.
Формат вывода

Выводится одно число.

"""


a = 999999
b = 142857
x = a - b
print(x)
