"""
Напишите программу, которая выводит произведение всех целых чисел от 1 до 9.
"""


print(2 * 3 * 4 * 5 * 6 * 7 * 8 * 9)
